bbtq/ti_mspm0_project/KEIL/ti-24-car/ti_msp_dl_config.h
/*
 * Copyright (c) 2021, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the MSPM0L130X
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_MSPM0L130X

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)



#define CPUCLK_FREQ                                                     32000000



/* Defines for motor_pwm */
#define motor_pwm_INST                                                     TIMG1
#define motor_pwm_INST_IRQHandler                               TIMG1_IRQHandler
#define motor_pwm_INST_INT_IRQN                                 (TIMG1_INT_IRQn)
#define motor_pwm_INST_CLK_FREQ                                         32000000
/* GPIO defines for channel 0 */
#define GPIO_motor_pwm_C0_PORT                                             GPIOA
#define GPIO_motor_pwm_C0_PIN                                     DL_GPIO_PIN_26
#define GPIO_motor_pwm_C0_IOMUX                                  (IOMUX_PINCM27)
#define GPIO_motor_pwm_C0_IOMUX_FUNC                 IOMUX_PINCM27_PF_TIMG1_CCP0
#define GPIO_motor_pwm_C0_IDX                                DL_TIMER_CC_0_INDEX
/* GPIO defines for channel 1 */
#define GPIO_motor_pwm_C1_PORT                                             GPIOA
#define GPIO_motor_pwm_C1_PIN                                     DL_GPIO_PIN_27
#define GPIO_motor_pwm_C1_IOMUX                                  (IOMUX_PINCM28)
#define GPIO_motor_pwm_C1_IOMUX_FUNC                 IOMUX_PINCM28_PF_TIMG1_CCP1
#define GPIO_motor_pwm_C1_IDX                                DL_TIMER_CC_1_INDEX


/* Defines for TIMER_0 */
#define TIMER_0_INST                                                     (TIMG0)
#define TIMER_0_INST_IRQHandler                                 TIMG0_IRQHandler
#define TIMER_0_INST_INT_IRQN                                   (TIMG0_INT_IRQn)
#define TIMER_0_INST_LOAD_VALUE                                            (99U)




/* Defines for I2C0 */
#define I2C0_INST                                                           I2C0
#define I2C0_INST_IRQHandler                                     I2C0_IRQHandler
#define I2C0_INST_INT_IRQN                                         I2C0_INT_IRQn
#define I2C0_BUS_SPEED_HZ                                                 100000
#define GPIO_I2C0_SDA_PORT                                                 GPIOA
#define GPIO_I2C0_SDA_PIN                                          DL_GPIO_PIN_0
#define GPIO_I2C0_IOMUX_SDA                                       (IOMUX_PINCM1)
#define GPIO_I2C0_IOMUX_SDA_FUNC                        IOMUX_PINCM1_PF_I2C0_SDA
#define GPIO_I2C0_SCL_PORT                                                 GPIOA
#define GPIO_I2C0_SCL_PIN                                          DL_GPIO_PIN_1
#define GPIO_I2C0_IOMUX_SCL                                       (IOMUX_PINCM2)
#define GPIO_I2C0_IOMUX_SCL_FUNC                        IOMUX_PINCM2_PF_I2C0_SCL


/* Defines for UART_0 */
#define UART_0_INST                                                        UART0
#define UART_0_INST_IRQHandler                                  UART0_IRQHandler
#define UART_0_INST_INT_IRQN                                      UART0_INT_IRQn
#define GPIO_UART_0_RX_PORT                                                GPIOA
#define GPIO_UART_0_TX_PORT                                                GPIOA
#define GPIO_UART_0_RX_PIN                                        DL_GPIO_PIN_22
#define GPIO_UART_0_TX_PIN                                        DL_GPIO_PIN_23
#define GPIO_UART_0_IOMUX_RX                                     (IOMUX_PINCM23)
#define GPIO_UART_0_IOMUX_TX                                     (IOMUX_PINCM24)
#define GPIO_UART_0_IOMUX_RX_FUNC                      IOMUX_PINCM23_PF_UART0_RX
#define GPIO_UART_0_IOMUX_TX_FUNC                      IOMUX_PINCM24_PF_UART0_TX
#define UART_0_BAUD_RATE                                                  (9600)
#define UART_0_IBRD_4_MHZ_9600_BAUD                                         (26)
#define UART_0_FBRD_4_MHZ_9600_BAUD                                          (3)





/* Defines for adc */
#define adc_INST                                                            ADC0
#define adc_INST_IRQHandler                                      ADC0_IRQHandler
#define adc_INST_INT_IRQN                                        (ADC0_INT_IRQn)
#define adc_ADCMEM_1                                          DL_ADC12_MEM_IDX_0
#define adc_ADCMEM_1_REF                         DL_ADC12_REFERENCE_VOLTAGE_VDDA
#define adc_ADCMEM_1_REF_VOLTAGE                                              -1 // VDDA cannot be determined
#define adc_ADCMEM_2                                          DL_ADC12_MEM_IDX_1
#define adc_ADCMEM_2_REF                         DL_ADC12_REFERENCE_VOLTAGE_VDDA
#define adc_ADCMEM_2_REF_VOLTAGE                                              -1 // VDDA cannot be determined
#define GPIO_adc_C2_PORT                                                   GPIOA
#define GPIO_adc_C2_PIN                                           DL_GPIO_PIN_25
#define GPIO_adc_C3_PORT                                                   GPIOA
#define GPIO_adc_C3_PIN                                           DL_GPIO_PIN_24



/* Port definition for Pin Group LED1 */
#define LED1_PORT                                                        (GPIOA)

/* Defines for PIN_14: GPIOA.14 with pinCMx 15 on package pin 18 */
#define LED1_PIN_14_PIN                                         (DL_GPIO_PIN_14)
#define LED1_PIN_14_IOMUX                                        (IOMUX_PINCM15)
/* Port definition for Pin Group KEY */
#define KEY_PORT                                                         (GPIOA)

/* Defines for PIN_18: GPIOA.18 with pinCMx 19 on package pin 22 */
// groups represented: ["motor_count","KEY"]
// pins affected: ["L_A","L_B","R_A","R_B","PIN_18"]
#define GPIO_MULTIPLE_GPIOA_INT_IRQN                            (GPIOA_INT_IRQn)
#define GPIO_MULTIPLE_GPIOA_INT_IIDX            (DL_INTERRUPT_GROUP1_IIDX_GPIOA)
#define KEY_PIN_18_IIDX                                     (DL_GPIO_IIDX_DIO18)
#define KEY_PIN_18_PIN                                          (DL_GPIO_PIN_18)
#define KEY_PIN_18_IOMUX                                         (IOMUX_PINCM19)
/* Port definition for Pin Group motor_in */
#define motor_in_PORT                                                    (GPIOA)

/* Defines for L1: GPIOA.5 with pinCMx 6 on package pin 9 */
#define motor_in_L1_PIN                                          (DL_GPIO_PIN_5)
#define motor_in_L1_IOMUX                                         (IOMUX_PINCM6)
/* Defines for L2: GPIOA.6 with pinCMx 7 on package pin 10 */
#define motor_in_L2_PIN                                          (DL_GPIO_PIN_6)
#define motor_in_L2_IOMUX                                         (IOMUX_PINCM7)
/* Defines for R1: GPIOA.7 with pinCMx 8 on package pin 11 */
#define motor_in_R1_PIN                                          (DL_GPIO_PIN_7)
#define motor_in_R1_IOMUX                                         (IOMUX_PINCM8)
/* Defines for R2: GPIOA.8 with pinCMx 9 on package pin 12 */
#define motor_in_R2_PIN                                          (DL_GPIO_PIN_8)
#define motor_in_R2_IOMUX                                         (IOMUX_PINCM9)
/* Port definition for Pin Group motor_count */
#define motor_count_PORT                                                 (GPIOA)

/* Defines for L_A: GPIOA.9 with pinCMx 10 on package pin 13 */
#define motor_count_L_A_IIDX                                 (DL_GPIO_IIDX_DIO9)
#define motor_count_L_A_PIN                                      (DL_GPIO_PIN_9)
#define motor_count_L_A_IOMUX                                    (IOMUX_PINCM10)
/* Defines for L_B: GPIOA.10 with pinCMx 11 on package pin 14 */
#define motor_count_L_B_IIDX                                (DL_GPIO_IIDX_DIO10)
#define motor_count_L_B_PIN                                     (DL_GPIO_PIN_10)
#define motor_count_L_B_IOMUX                                    (IOMUX_PINCM11)
/* Defines for R_A: GPIOA.11 with pinCMx 12 on package pin 15 */
#define motor_count_R_A_IIDX                                (DL_GPIO_IIDX_DIO11)
#define motor_count_R_A_PIN                                     (DL_GPIO_PIN_11)
#define motor_count_R_A_IOMUX                                    (IOMUX_PINCM12)
/* Defines for R_B: GPIOA.12 with pinCMx 13 on package pin 16 */
#define motor_count_R_B_IIDX                                (DL_GPIO_IIDX_DIO12)
#define motor_count_R_B_PIN                                     (DL_GPIO_PIN_12)
#define motor_count_R_B_IOMUX                                    (IOMUX_PINCM13)



/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_motor_pwm_init(void);
void SYSCFG_DL_TIMER_0_init(void);
void SYSCFG_DL_I2C0_init(void);
void SYSCFG_DL_UART_0_init(void);
void SYSCFG_DL_adc_init(void);

void SYSCFG_DL_SYSTICK_init(void);


#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
